docs/pn-ou5-pipeline.org
#+OPTIONS: ^:{}
* New slits 2023
- Michael took some new [O III] spectra
- Tere has sent me the files [2023-03-30 Thu]
- But she did not manage to remove the cosmic rays

** Remove cosmic rays
- Python program to remove cosmic rays from the spectra
- Options include ~ccdproc.cosmicray_lacosmic~
- Or astroscrappy, which seems to be the same algorithm


*** Diego's intent to remove cosmic rays
- Diego says it is not working, so I will try it
- I have made the following changes
  - I have changed the path to look in the current folder
  - I have removed the figure parts, since we can just look at the FITS files
#+begin_src sh :dir ../diego-remove-cosmicrays
python remove_cosmicRay.py
#+end_src

#+RESULTS:
    

* Stages in data reduction and analysis
+ I am going to follow similar steps to what I did with the Owl and the Turtle
+ But this time I will try and make a proper re-useable python library, rather than just have snippets of code spread over an org file
+ And I will make jupyter notebooks to demonstrate use of the library
** 00 Preliminary organization
*** Find list of image+slit exposures
+ This is done in [[file:../notebooks/00-00-inspect-orig-files.py][00-00-inspect-orig-files.py]]
  + [[file:../notebooks/00-00-inspect-orig-files.ipynb][00-00-inspect-orig-files.ipynb]]
**** A database of all the image+slit files
| N10035   | Ha        |
| N10042   | Ha        |
| N10047o  | Missing   |
| N20001   | Unfocused |
| N20008   | [O III]   |
| N20011   | Ha        |
| spm0020o | Ha        |
| spm0025o | [O III]   |
| spm0047o | Ha        |
| spm0052o | [O III]   |
| spm0053o | Ha        |
| spm0058o | [O III]   |
| spm0109o | [O III]   |
| spm0210o | Ha        |
| spm0214o | Ha        |
| spm0431o | Ha        |
| spm0439o | Ha        |
| spm0600o | Ha        |

+ I will make a YAML file by hand, even though some of the info could be obtained automatically
+ To start off with, I will key it all by the image name, but I might change that later

#+begin_src yaml :tangle ../data/image-slit-database.yml
  -
    image_id: N10035   
    line_id: Ha        
  -
    image_id: N10042   
    line_id: Ha        
  -
    image_id: N10047o  
    problem: Missing   
  -
    image_id: N20001   
    problem: Unfocused 
  -
    image_id: N20008   
    line_id: O III   
  -
    image_id: N20011   
    line_id: Ha        
  -
    image_id: spm0020o 
    line_id: Ha        
  -
    image_id: spm0025o 
    line_id: O III   
  -
    image_id: spm0047o 
    line_id: Ha        
  -
    image_id: spm0052o 
    line_id: O III   
  -
    image_id: spm0053o 
    line_id: Ha        
  -
    image_id: spm0058o 
    line_id: O III   
  -
    image_id: spm0109o 
    line_id: O III   
  -
    image_id: spm0104o 
    line_id: Ha   
  -
    image_id: spm0210o 
    line_id: Ha        
  -
    image_id: spm0214o 
    line_id: Ha        
  -
    image_id: spm0431o 
    line_id: Ha        
  -
    image_id: spm0439o 
    line_id: Ha        
  -
    image_id: spm0600o 
    line_id: Ha        
#+end_src


*** Set up astrometry.net
1. Find which HEALpix tiles to use
   + This is done in [[file:../notebooks/00-00-inspect-orig-files.py][00-00-inspect-orig-files.py]]
     + [[file:../notebooks/00-00-inspect-orig-files.ipynb][00-00-inspect-orig-files.ipynb]]
2. Download data files from http://data.astrometry.net/5000/
   + I got ~index500[0-4]-14.fits~ and ~index500[5-7]-03.fits~
   + Note that ~astropy_healpix~ did not help much here - it gave a different ID for the tile from what astrometry-net was using
3. Copy data files to [[file:../data/astrometry-net/]]
4. Install ~astrometry-net~
   - Used Homebrew
5. Configure ~astrometry-net~
   - [[file:../data/astrometry-net/astrometry.cfg]]
   - Turn on ~inparallel~
   - Use ~add_path~ to add my data folder (see above)
*** Test of YAML files
**** Make a YAML file for testing
#+begin_src yaml :tangle test.yml
  this: that
  tother:
    - one
    - two
    - three
#+end_src
