docs/pn-ou5-pipeline.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-12-09 Tue 14:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="William Henney" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4d18010">1. New slits 2023</a>
<ul>
<li><a href="#org08e4c19">1.1. Remove cosmic rays</a>
<ul>
<li><a href="#org6db087e">1.1.1. Diego's intent to remove cosmic rays</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4eede50">2. Stages in data reduction and analysis</a>
<ul>
<li><a href="#org37951ca">2.1. 00 Preliminary organization</a>
<ul>
<li><a href="#org0120f18">2.1.1. Find list of image+slit exposures</a></li>
<li><a href="#org27d7ad0">2.1.2. Set up astrometry.net</a></li>
<li><a href="#org7b71726">2.1.3. Test of YAML files</a></li>
<li><a href="#org8143a04">2.1.4. Databases of all the spectrum slits</a></li>
</ul>
</li>
<li><a href="#orgf9f227d">2.2. <code>[2/2]</code> 01 Astrometry and median combination of images+slit</a>
<ul>
<li><a href="#org88fe14c">2.2.1. <span class="done DONE">DONE</span> TASK 01-00 Run <code>astrometry-net</code> on all the images</a></li>
<li><a href="#orgb600d40">2.2.2. <span class="done DONE">DONE</span> TASK 01-01 Generating the median images</a></li>
</ul>
</li>
<li><a href="#org339ac59">2.3. <code>[3/3]</code> 02 Photometry and WCS info for slit spectra</a>
<ul>
<li><a href="#org3563217">2.3.1. <span class="done DONE">DONE</span> TASK 02-00 Port the routines from <code>turtle_utils.py</code></a></li>
<li><a href="#org10a3d7a">2.3.2. <span class="done DONE">DONE</span> TASK 02-01 Reference profiles from median image and compare with slit profiles</a></li>
<li><a href="#orge8f77a3">2.3.3. <span class="done DONE">DONE</span> TASK 02-03 Write out extracted PV spectra with celestial coordinates</a></li>
</ul>
</li>
<li><a href="#org85f846e">2.4. <span class="done DONE">DONE</span> 03 Isovelocity images</a></li>
<li><a href="#orgea97317">2.5. <span class="done DONE">DONE</span> 04 Combine axial slits and make some plots</a></li>
<li><a href="#org8d405ad">2.6. <span class="todo TODO">TODO</span> Comparison of my slit positions with the paper</a>
<ul>
<li><a href="#orgda07da0">2.6.1. Table of spectra from 00-00-inspect-orig-files</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org3cd2fe2">3. Initial messages from Teresa</a>
<ul>
<li><a href="#org42b319f">3.1. 2021-06-21</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org4d18010" class="outline-2">
<h2 id="org4d18010"><span class="section-number-2">1.</span> New slits 2023</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Michael took some new [O III] spectra</li>
<li>Tere has sent me the files <span class="timestamp-wrapper"><span class="timestamp">[2023-03-30 Thu]</span></span></li>
<li>But she did not manage to remove the cosmic rays</li>
</ul>
</div>
<div id="outline-container-org08e4c19" class="outline-3">
<h3 id="org08e4c19"><span class="section-number-3">1.1.</span> Remove cosmic rays</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Python program to remove cosmic rays from the spectra</li>
<li>Options include <code>ccdproc.cosmicray_lacosmic</code></li>
<li>Or astroscrappy, which seems to be the same algorithm</li>
</ul>
</div>
<div id="outline-container-org6db087e" class="outline-4">
<h4 id="org6db087e"><span class="section-number-4">1.1.1.</span> Diego's intent to remove cosmic rays</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>Diego says it is not working, so I will try it</li>
<li>I have made the following changes
<ul class="org-ul">
<li>I have changed the path to look in the current folder</li>
<li>I have removed the figure parts, since we can just look at the FITS files</li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">python remove_cosmicRay.py
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org4eede50" class="outline-2">
<h2 id="org4eede50"><span class="section-number-2">2.</span> Stages in data reduction and analysis</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>I am going to follow similar steps to what I did with the Owl and the Turtle</li>
<li>But this time I will try and make a proper re-useable python library, rather than just have snippets of code spread over an org file</li>
<li>And I will make jupyter notebooks to demonstrate use of the library</li>
</ul>
</div>
<div id="outline-container-org37951ca" class="outline-3">
<h3 id="org37951ca"><span class="section-number-3">2.1.</span> 00 Preliminary organization</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org0120f18" class="outline-4">
<h4 id="org0120f18"><span class="section-number-4">2.1.1.</span> Find list of image+slit exposures</h4>
<div class="outline-text-4" id="text-2-1-1">
<ul class="org-ul">
<li>This is done in <a href="../notebooks/00-00-inspect-orig-files.py">00-00-inspect-orig-files.py</a>
<ul class="org-ul">
<li><a href="../notebooks/00-00-inspect-orig-files.ipynb">00-00-inspect-orig-files.ipynb</a></li>
</ul></li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org83e69a1"></a>A database of all the image+slit files<br />
<div class="outline-text-5" id="text-2-1-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">N10035</td>
<td class="org-left">Ha</td>
</tr>

<tr>
<td class="org-left">N10042</td>
<td class="org-left">Ha</td>
</tr>

<tr>
<td class="org-left">N10047o</td>
<td class="org-left">Missing</td>
</tr>

<tr>
<td class="org-left">N20001</td>
<td class="org-left">Unfocused</td>
</tr>

<tr>
<td class="org-left">N20008</td>
<td class="org-left">[O III]</td>
</tr>

<tr>
<td class="org-left">N20011</td>
<td class="org-left">Ha</td>
</tr>

<tr>
<td class="org-left">spm0020o</td>
<td class="org-left">Ha</td>
</tr>

<tr>
<td class="org-left">spm0025o</td>
<td class="org-left">[O III]</td>
</tr>

<tr>
<td class="org-left">spm0047o</td>
<td class="org-left">Ha</td>
</tr>

<tr>
<td class="org-left">spm0052o</td>
<td class="org-left">[O III]</td>
</tr>

<tr>
<td class="org-left">spm0053o</td>
<td class="org-left">Ha</td>
</tr>

<tr>
<td class="org-left">spm0058o</td>
<td class="org-left">[O III]</td>
</tr>

<tr>
<td class="org-left">spm0109o</td>
<td class="org-left">[O III]</td>
</tr>

<tr>
<td class="org-left">spm0210o</td>
<td class="org-left">Ha</td>
</tr>

<tr>
<td class="org-left">spm0214o</td>
<td class="org-left">Ha</td>
</tr>

<tr>
<td class="org-left">spm0431o</td>
<td class="org-left">Ha</td>
</tr>

<tr>
<td class="org-left">spm0439o</td>
<td class="org-left">Ha</td>
</tr>

<tr>
<td class="org-left">spm0600o</td>
<td class="org-left">Ha</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>I will make a YAML file by hand, even though some of the info could be obtained automatically</li>
<li>To start off with, I will key it all by the image name, but I might change that later</li>
</ul>

<div class="org-src-container">
<pre class="src src-yaml">-
  image_id: N10035   
  line_id: Ha        
-
  image_id: N10042   
  line_id: Ha        
-
  image_id: N10047o  
  problem: Missing   
-
  image_id: N20001   
  problem: Unfocused 
-
  image_id: N20008   
  line_id: O III   
-
  image_id: N20011   
  line_id: Ha        
-
  image_id: spm0020o 
  line_id: Ha        
-
  image_id: spm0025o 
  line_id: O III   
-
  image_id: spm0047o 
  line_id: Ha        
-
  image_id: spm0052o 
  line_id: O III   
-
  image_id: spm0053o 
  line_id: Ha        
-
  image_id: spm0058o 
  line_id: O III   
-
  image_id: spm0109o 
  line_id: O III   
-
  image_id: spm0104o 
  line_id: Ha   
-
  image_id: spm0210o 
  line_id: Ha        
-
  image_id: spm0214o 
  line_id: Ha        
-
  image_id: spm0431o 
  line_id: Ha        
-
  image_id: spm0439o 
  line_id: Ha        
-
  image_id: spm0600o 
  line_id: Ha        
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org27d7ad0" class="outline-4">
<h4 id="org27d7ad0"><span class="section-number-4">2.1.2.</span> Set up astrometry.net</h4>
<div class="outline-text-4" id="text-2-1-2">
<ol class="org-ol">
<li>Find which HEALpix tiles to use
<ul class="org-ul">
<li>This is done in <a href="../notebooks/00-00-inspect-orig-files.py">00-00-inspect-orig-files.py</a>
<ul class="org-ul">
<li><a href="../notebooks/00-00-inspect-orig-files.ipynb">00-00-inspect-orig-files.ipynb</a></li>
</ul></li>
</ul></li>
<li>Download data files from <a href="http://data.astrometry.net/5000/">http://data.astrometry.net/5000/</a>
<ul class="org-ul">
<li>I got <code>index500[0-4]-14.fits</code> and <code>index500[5-7]-03.fits</code></li>
<li>Note that <code>astropy_healpix</code> did not help much here - it gave a different ID for the tile from what astrometry-net was using</li>
</ul></li>
<li>Copy data files to <a href="../data/astrometry-net/">../data/astrometry-net/</a></li>
<li>Install <code>astrometry-net</code>
<ul class="org-ul">
<li>Used Homebrew</li>
</ul></li>
<li>Configure <code>astrometry-net</code>
<ul class="org-ul">
<li><a href="../data/astrometry-net/astrometry.cfg">../data/astrometry-net/astrometry.cfg</a></li>
<li>Turn on <code>inparallel</code></li>
<li>Use <code>add_path</code> to add my data folder (see above)</li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-org7b71726" class="outline-4">
<h4 id="org7b71726"><span class="section-number-4">2.1.3.</span> Test of YAML files</h4>
<div class="outline-text-4" id="text-2-1-3">
</div>
<ol class="org-ol">
<li><a id="orgd8a1c65"></a>Make a YAML file for testing<br />
<div class="outline-text-5" id="text-2-1-3-1">
<div class="org-src-container">
<pre class="src src-yaml">this: that
tother:
  - one
  - two
  - three
</pre>
</div>
</div>
</li>
