docs/pn-ou5-pipeline.org
**** Read in test file as a dict
#+begin_src python :return data :results verbatim
  import yaml

  data = yaml.load(open("test.yml"))
#+end_src

#+RESULTS:
: {'this': 'that', 'tother': ['one', 'two', 'three']}

That seems to work fine

#+begin_src python :return data :results verbatim
  import yaml

  data = yaml.load(open("../data/image-slit-database.yml"))
#+end_src

#+RESULTS:
: [{'image_id': 'N10035', 'line_id': 'Ha'}, {'image_id': 'N10042', 'line_id': 'Ha'}, {'image_id': 'N10047o', 'problem': 'Missing'}, {'image_id': 'N20001', 'problem': 'Unfocused'}, {'image_id': 'N20008', 'line_id': 'O III'}, {'image_id': 'N20011', 'line_id': 'Ha'}, {'image_id': 'spm0020o', 'line_id': 'Ha'}, {'image_id': 'spm0025o', 'line_id': 'O III'}, {'image_id': 'spm0047o', 'line_id': 'Ha'}, {'image_id': 'spm0052o', 'line_id': 'O III'}, {'image_id': 'spm0053o', 'line_id': 'Ha'}, {'image_id': 'spm0058o', 'line_id': 'O III'}, {'image_id': 'spm0109o', 'line_id': 'O III'}, {'image_id': 'spm0210o', 'line_id': 'Ha'}, {'image_id': 'spm0214o', 'line_id': 'Ha'}, {'image_id': 'spm0431o', 'line_id': 'Ha'}, {'image_id': 'spm0439o', 'line_id': 'Ha'}, {'image_id': 'spm0600o', 'line_id': 'Ha'}]

**** Load into a dataframe and astropy Table

Astropy table deals well with missing values

#+begin_src python :return data :results verbatim
  import yaml
  from astropy.table import Table

  data = yaml.load(open("../data/image-slit-database.yml"))
  data = Table(data)
#+end_src

#+RESULTS:
#+begin_example
image_id line_id  problem 
-------- ------- ---------
  N10035      Ha        --
  N10042      Ha        --
 N10047o      --   Missing
  N20001      -- Unfocused
  N20008   O III        --
  N20011      Ha        --
spm0020o      Ha        --
spm0025o   O III        --
spm0047o      Ha        --
spm0052o   O III        --
spm0053o      Ha        --
spm0058o   O III        --
spm0109o   O III        --
spm0210o      Ha        --
spm0214o      Ha        --
spm0431o      Ha        --
spm0439o      Ha        --
spm0600o      Ha        --
#+end_example

And so does pandas:

#+begin_src python :return data :results verbatim
  import yaml
  from pandas import DataFrame

  data = yaml.load(open("../data/image-slit-database.yml"))
  data = DataFrame(data)
#+end_src

#+RESULTS:
#+begin_example
    image_id line_id    problem
0     N10035      Ha        NaN
1     N10042      Ha        NaN
2    N10047o     NaN    Missing
3     N20001     NaN  Unfocused
4     N20008   O III        NaN
5     N20011      Ha        NaN
6   spm0020o      Ha        NaN
7   spm0025o   O III        NaN
8   spm0047o      Ha        NaN
9   spm0052o   O III        NaN
10  spm0053o      Ha        NaN
11  spm0058o   O III        NaN
12  spm0109o   O III        NaN
13  spm0210o      Ha        NaN
14  spm0214o      Ha        NaN
15  spm0431o      Ha        NaN
16  spm0439o      Ha        NaN
17  spm0600o      Ha        NaN
#+end_example


*** Databases of all the spectrum slits
**** [O III] slits
#+begin_src yaml :tangle ../data/slits-o3.yml
  -
    slit_id: N10039
    orig_file: crN10039_bx-oiii.fits
    image_id: N10035
    line_id: O III
    slit_width: 70
    comment: >-
      Just E of center. 
      Highest resolution for the inner shell.
      Image is Ha, not O III. 
  -
    slit_id: N10045
    orig_file: crN10045_bx-oiii.fits
    image_id: N10042
    line_id: O III
    slit_width: 70
    comment: >-
      Grazes E limb.
      Shows part of outer lobe.
      Image is Ha, not O III.
  -
    slit_id: N20006
    orig_file: crN20006_bx-oiii.fits
    image_id: N20008
    line_id: O III
    slit_width: 70
    comment: >-
      Crosses E limb. 
  -
    slit_id: spm0023o
    orig_file: crspm0023o_bx-oiii.fits
    image_id: spm0025o
    line_id: O III
    slit_width: 150
    comment: >-
      Grazes E limb. 
  -
    slit_id: spm0050o
    orig_file: crspm0050o_bx.fits
    image_id: spm0052o
    line_id: O III
    slit_width: 150
    comment: >-
      E of center.
      Shows outer lobes well.
      Shows central blue wing.
  -
    slit_id: spm0056o
    orig_file: crspm0056o_bx.fits
    image_id: spm0058o
    line_id: O III
    slit_width: 150
    comment: >-
      Just W of center.
      Shows outer lobes well.
      Shows central blue wing.
      Shows weak continuum from unrelated star. 
  -
    slit_id: spm0107o
    orig_file: crspm0107o_bx.fits
    image_id: spm0109o
    line_id: O III
    slit_width: 150
    comment: >-
      W of center.
      Shows outer lobes well.
      Shows central blue wing.

#+end_src

+ Some thoughts:
  - We could co-add the last 3 [O III] slits: spm0050o, spm0056o, spm0107o
    - They look very similar in nearly all respects, and it would improve s/n for the fainter features
  - We have no [O III] slits of the W limb, which is a shame


Check that the file loads OK.

#+begin_src python :return data :results verbatim
  import yaml
  from pandas import DataFrame

  data = yaml.load(open("../data/slits-o3.yml"))
  data = DataFrame(data)
#+end_src

#+RESULTS:
#+begin_example
    slit_id  ...                                            comment
0    N10039  ...  Just E of center.  Highest resolution for the ...
1    N10045  ...            Grazes E limb.  Image is Ha, not O III.
2    N20006  ...                                   Crosses E limb. 
3  spm0023o  ...                                    Grazes E limb. 
4  spm0050o  ...  E of center. Shows outer lobes well. Shows cen...
5  spm0056o  ...  Exact center. Shows outer lobes well. Shows ce...
6  spm0107o  ...  W of center. Shows outer lobes well. Shows cen...

[7 rows x 6 columns]
#+end_example

Looks good. 

