docs/pn-ou5-pipeline.org
**** Ha slits
#+begin_src yaml :tangle ../data/slits-ha.yml
  -
    slit_id: N10036
    orig_file: crN10036_bx.fits
    image_id: N10035
    line_id: Ha
    slit_width: 70
    comment: >-
      Just E of center.
  -
    slit_id: N10043
    orig_file: crN10043_bx.fits
    image_id: N10042
    line_id: Ha
    slit_width: 70
    comment: >-
      Grazes E limb.
  -
    slit_id: N20004
    orig_file: crN20004_bx.fits
    image_id: N20008
    line_id: Ha
    slit_width: 70
    comment: >-
      Crosses E limb.
      Image is O III, not Ha.
  -
    slit_id: N20012
    orig_file: crN20012_bx.fits
    image_id: N20011
    line_id: Ha
    slit_width: 70
    comment: >-
      W of center.
  -
    slit_id: spm0021o
    orig_file: crspm0021o_bx.fits
    image_id: spm0020o
    line_id: Ha
    slit_width: 150
    comment: >-
      Grazes E limb.
  -
    slit_id: spm0048o
    orig_file: crspm0048o_bx.fits
    image_id: spm0047o
    line_id: Ha
    slit_width: 150
    comment: >-
      Just E of center.
  -
    slit_id: spm0054o
    orig_file: crspm0054o_bx.fits
    image_id: spm0053o
    line_id: Ha
    slit_width: 150
    comment: >-
      Just W of center.
      Crosses unrelated star.
  -
    slit_id: spm0105o
    orig_file: crspm0105o_bx.fits
    image_id: spm0104o
    line_id: Ha
    slit_width: 150
    comment: >-
      W of center.
  -
    slit_id: spm0211o
    orig_file: crspm0211o_b1t.fits
    image_id: spm0210o
    line_id: Ha
    slit_width: 150
    comment: >-
      Just W of center.
  -
    slit_id: spm0215o
    orig_file: crspm0215o_b1t.fits
    image_id: spm0214o
    line_id: Ha
    slit_width: 150
    comment: >-
      Crosses W limb.
  -
    slit_id: spm0432o
    orig_file: crspm0432o_b1t.fits
    image_id: spm0431o
    line_id: Ha
    slit_width: 150
    comment: >-
      E of center.
  -
    slit_id: spm0440o
    orig_file: crspm0440o_b1t.fits
    image_id: spm0439o
    line_id: Ha
    slit_width: 150
    comment: >-
      Horizontal slit.
  -
    slit_id: spm0601o
    orig_file: crspm0601o_b1t.fits
    image_id: spm0600o
    line_id: Ha
    slit_width: 150
    comment: >-
      Crosses W limb.


#+end_src

#+begin_src python :return data :results verbatim
  import yaml
  from pandas import DataFrame

  data = yaml.load(open("../data/slits-ha.yml"))
  data = DataFrame(data)
#+end_src

#+RESULTS:
#+begin_example
     slit_id            orig_file  ...            trim shift_range
0     N10036     crN10036_bx.fits  ...             NaN         NaN
1     N10043     crN10043_bx.fits  ...             NaN         NaN
2     N20004     crN20004_bx.fits  ...             NaN         NaN
3     N20012     crN20012_bx.fits  ...  [0, 0, 0, -50]   [50, 110]
4   spm0021o   crspm0021o_bx.fits  ...             NaN         NaN
5   spm0048o   crspm0048o_bx.fits  ...             NaN         NaN
6   spm0054o   crspm0054o_bx.fits  ...             NaN         NaN
7   spm0105o   crspm0105o_bx.fits  ...             NaN         NaN
8   spm0211o  crspm0211o_b1t.fits  ...             NaN         NaN
9   spm0215o  crspm0215o_b1t.fits  ...             NaN         NaN
10  spm0432o  crspm0432o_b1t.fits  ...             NaN         NaN
11  spm0440o  crspm0440o_b1t.fits  ...             NaN         NaN
12  spm0601o  crspm0601o_b1t.fits  ...             NaN         NaN

[13 rows x 10 columns]
#+end_example

** [2/2] 01 Astrometry and median combination of images+slit

*** DONE TASK 01-00 Run ~astrometry-net~ on all the images
CLOSED: [2021-11-05 Fri 19:45]
+ The only tricky parts here were
  1. Finding the correct HEALpix tile (see above)
  2. Putting sensible limits on the pixel scale
+ Once those were resolved then solutions are found very rapidly for all the images.
+ Run these in the terminal
  + I divide the images in two groups since the pixel scale is different
+ The ones starting ~crN~ have 2x2 binning
  #+begin_src sh :dir ../data :results verbatim :eval no
    for F in $(grep crN image-list.dat); do
        solve-field --config astrometry-net/astrometry.cfg \
                --ra 318.58 --dec 43.69 --radius 1.0\
                --scale-units arcsecperpix --scale-low 0.3 --scale-high 0.4\
                --depth 50 --dir wcs --new-fits '%s-wcs.fits'\
                --no-tweak --overwrite originals/$F.fits 
    done
  #+end_src
+ The ones starting ~crspm~ have 3x3 binning
  #+begin_src sh :dir ../data :results verbatim :eval no
    for F in $(grep crspm image-list.dat); do
        solve-field --config astrometry-net/astrometry.cfg \
                --ra 318.58 --dec 43.69 --radius 1.0\
                --scale-units arcsecperpix --scale-low 0.5 --scale-high 0.6\
                --depth 50 --dir wcs --new-fits '%s-wcs.fits'\
                --no-tweak --overwrite originals/$F.fits 
    done
  #+end_src
+ The one I forgot
  #+begin_src sh :dir ../data :results verbatim :eval no
    F=crspm0104o_b
    solve-field --config astrometry-net/astrometry.cfg \
            --ra 318.58 --dec 43.69 --radius 1.0\
            --scale-units arcsecperpix --scale-low 0.5 --scale-high 0.6\
            --depth 50 --dir wcs --new-fits '%s-wcs.fits'\
            --no-tweak --overwrite originals/$F.fits 
  #+end_src


*** DONE TASK 01-01 Generating the median images
CLOSED: [2021-11-05 Fri 19:45]
+ This is done in the notebook
  + [[file:../notebooks/01-00-image-astrometry.py]]
** [3/3] 02 Photometry and WCS info for slit spectra
+ We will generally follow the Turtle plan
+ But another thing we could do is to use the BG component in H alpha
*** DONE TASK 02-00 Port the routines from ~turtle_utils.py~
CLOSED: [2021-11-10 Wed 19:23]
+ These need to be generalised a bit and put in [[file:../src/mes_longslit/]]
+ They are in [[file:../src/mes_longslit/slit_utils.py]]
*** DONE TASK 02-01 Reference profiles from median image and compare with slit profiles
CLOSED: [2021-11-10 Wed 19:24]
+ This is done in [[file:../notebooks/02-01-test-normalize.py]] for Ha
+ And in [[file:../notebooks/02-02-o3-normalize.py]] for [O III]
+ They use the routine ~pv_extract()~ from the library

*** DONE [#B] TASK 02-03 Write out extracted PV spectra with celestial coordinates
CLOSED: [2021-11-10 Wed 19:27]
+ This is done with the same notebooks as above
+ The files are in [[file:../data/pvextract/]]
+ The have two different WCS systems
  + Default is just wavelength, offset
  + ~A~ is a fancy one
    + with 3 WCS axes mapping on to 2 image axes
    + wavelength, RA, and Dec


** DONE [#A] 03 Isovelocity images
CLOSED: [2022-03-02 Wed 07:22]
+ This is done in 03-01-test-vmap
  + Notebook [[file:../notebooks/03-01-test-vmap.ipynb]]
  + Pure python version: [[file:../notebooks/03-01-test-vmap.py]]
