docs/pn-ou5-pipeline.html
<li><a id="org30a0ce4"></a>Ha slits<br />
<div class="outline-text-5" id="text-2-1-4-2">
<div class="org-src-container">
<pre class="src src-yaml">-
  slit_id: N10036
  orig_file: crN10036_bx.fits
  image_id: N10035
  line_id: Ha
  slit_width: 70
  comment: &gt;-
    Just E of center.
-
  slit_id: N10043
  orig_file: crN10043_bx.fits
  image_id: N10042
  line_id: Ha
  slit_width: 70
  comment: &gt;-
    Grazes E limb.
-
  slit_id: N20004
  orig_file: crN20004_bx.fits
  image_id: N20008
  line_id: Ha
  slit_width: 70
  comment: &gt;-
    Crosses E limb.
    Image is O III, not Ha.
-
  slit_id: N20012
  orig_file: crN20012_bx.fits
  image_id: N20011
  line_id: Ha
  slit_width: 70
  comment: &gt;-
    W of center.
-
  slit_id: spm0021o
  orig_file: crspm0021o_bx.fits
  image_id: spm0020o
  line_id: Ha
  slit_width: 150
  comment: &gt;-
    Grazes E limb.
-
  slit_id: spm0048o
  orig_file: crspm0048o_bx.fits
  image_id: spm0047o
  line_id: Ha
  slit_width: 150
  comment: &gt;-
    Just E of center.
-
  slit_id: spm0054o
  orig_file: crspm0054o_bx.fits
  image_id: spm0053o
  line_id: Ha
  slit_width: 150
  comment: &gt;-
    Just W of center.
    Crosses unrelated star.
-
  slit_id: spm0105o
  orig_file: crspm0105o_bx.fits
  image_id: spm0104o
  line_id: Ha
  slit_width: 150
  comment: &gt;-
    W of center.
-
  slit_id: spm0211o
  orig_file: crspm0211o_b1t.fits
  image_id: spm0210o
  line_id: Ha
  slit_width: 150
  comment: &gt;-
    Just W of center.
-
  slit_id: spm0215o
  orig_file: crspm0215o_b1t.fits
  image_id: spm0214o
  line_id: Ha
  slit_width: 150
  comment: &gt;-
    Crosses W limb.
-
  slit_id: spm0432o
  orig_file: crspm0432o_b1t.fits
  image_id: spm0431o
  line_id: Ha
  slit_width: 150
  comment: &gt;-
    E of center.
-
  slit_id: spm0440o
  orig_file: crspm0440o_b1t.fits
  image_id: spm0439o
  line_id: Ha
  slit_width: 150
  comment: &gt;-
    Horizontal slit.
-
  slit_id: spm0601o
  orig_file: crspm0601o_b1t.fits
  image_id: spm0600o
  line_id: Ha
  slit_width: 150
  comment: &gt;-
    Crosses W limb.


</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">import yaml
from pandas import DataFrame

data = yaml.load(open("../data/slits-ha.yml"))
data = DataFrame(data)
</pre>
</div>

<pre class="example" id="orgf7d0315">
     slit_id            orig_file  ...            trim shift_range
0     N10036     crN10036_bx.fits  ...             NaN         NaN
1     N10043     crN10043_bx.fits  ...             NaN         NaN
2     N20004     crN20004_bx.fits  ...             NaN         NaN
3     N20012     crN20012_bx.fits  ...  [0, 0, 0, -50]   [50, 110]
4   spm0021o   crspm0021o_bx.fits  ...             NaN         NaN
5   spm0048o   crspm0048o_bx.fits  ...             NaN         NaN
6   spm0054o   crspm0054o_bx.fits  ...             NaN         NaN
7   spm0105o   crspm0105o_bx.fits  ...             NaN         NaN
8   spm0211o  crspm0211o_b1t.fits  ...             NaN         NaN
9   spm0215o  crspm0215o_b1t.fits  ...             NaN         NaN
10  spm0432o  crspm0432o_b1t.fits  ...             NaN         NaN
11  spm0440o  crspm0440o_b1t.fits  ...             NaN         NaN
12  spm0601o  crspm0601o_b1t.fits  ...             NaN         NaN

[13 rows x 10 columns]
</pre>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-orgf9f227d" class="outline-3">
<h3 id="orgf9f227d"><span class="section-number-3">2.2.</span> <code>[2/2]</code> 01 Astrometry and median combination of images+slit</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org88fe14c" class="outline-4">
<h4 id="org88fe14c"><span class="section-number-4">2.2.1.</span> <span class="done DONE">DONE</span> TASK 01-00 Run <code>astrometry-net</code> on all the images</h4>
<div class="outline-text-4" id="text-2-2-1">
<ul class="org-ul">
<li>The only tricky parts here were
<ol class="org-ol">
<li>Finding the correct HEALpix tile (see above)</li>
<li>Putting sensible limits on the pixel scale</li>
</ol></li>
<li>Once those were resolved then solutions are found very rapidly for all the images.</li>
<li>Run these in the terminal
<ul class="org-ul">
<li>I divide the images in two groups since the pixel scale is different</li>
</ul></li>
<li><p>
The ones starting <code>crN</code> have 2x2 binning
</p>
<div class="org-src-container">
<pre class="src src-sh">for F in $(grep crN image-list.dat); do
    solve-field --config astrometry-net/astrometry.cfg \
            --ra 318.58 --dec 43.69 --radius 1.0\
            --scale-units arcsecperpix --scale-low 0.3 --scale-high 0.4\
            --depth 50 --dir wcs --new-fits '%s-wcs.fits'\
            --no-tweak --overwrite originals/$F.fits 
done
</pre>
</div></li>
<li><p>
The ones starting <code>crspm</code> have 3x3 binning
</p>
<div class="org-src-container">
<pre class="src src-sh">for F in $(grep crspm image-list.dat); do
    solve-field --config astrometry-net/astrometry.cfg \
            --ra 318.58 --dec 43.69 --radius 1.0\
            --scale-units arcsecperpix --scale-low 0.5 --scale-high 0.6\
            --depth 50 --dir wcs --new-fits '%s-wcs.fits'\
            --no-tweak --overwrite originals/$F.fits 
done
</pre>
</div></li>
<li><p>
The one I forgot
</p>
<div class="org-src-container">
<pre class="src src-sh">F=crspm0104o_b
solve-field --config astrometry-net/astrometry.cfg \
        --ra 318.58 --dec 43.69 --radius 1.0\
        --scale-units arcsecperpix --scale-low 0.5 --scale-high 0.6\
        --depth 50 --dir wcs --new-fits '%s-wcs.fits'\
        --no-tweak --overwrite originals/$F.fits 
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-orgb600d40" class="outline-4">
<h4 id="orgb600d40"><span class="section-number-4">2.2.2.</span> <span class="done DONE">DONE</span> TASK 01-01 Generating the median images</h4>
<div class="outline-text-4" id="text-2-2-2">
<ul class="org-ul">
<li>This is done in the notebook
<ul class="org-ul">
<li><a href="../notebooks/01-00-image-astrometry.py">../notebooks/01-00-image-astrometry.py</a></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org339ac59" class="outline-3">
<h3 id="org339ac59"><span class="section-number-3">2.3.</span> <code>[3/3]</code> 02 Photometry and WCS info for slit spectra</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>We will generally follow the Turtle plan</li>
<li>But another thing we could do is to use the BG component in H alpha</li>
</ul>
</div>
<div id="outline-container-org3563217" class="outline-4">
<h4 id="org3563217"><span class="section-number-4">2.3.1.</span> <span class="done DONE">DONE</span> TASK 02-00 Port the routines from <code>turtle_utils.py</code></h4>
<div class="outline-text-4" id="text-2-3-1">
<ul class="org-ul">
<li>These need to be generalised a bit and put in <a href="../src/mes_longslit/">../src/mes_longslit/</a></li>
<li>They are in <a href="../src/mes_longslit/slit_utils.py">../src/mes_longslit/slit_utils.py</a></li>
</ul>
</div>
</div>
<div id="outline-container-org10a3d7a" class="outline-4">
<h4 id="org10a3d7a"><span class="section-number-4">2.3.2.</span> <span class="done DONE">DONE</span> TASK 02-01 Reference profiles from median image and compare with slit profiles</h4>
<div class="outline-text-4" id="text-2-3-2">
<ul class="org-ul">
<li>This is done in <a href="../notebooks/02-01-test-normalize.py">../notebooks/02-01-test-normalize.py</a> for Ha</li>
<li>And in <a href="../notebooks/02-02-o3-normalize.py">../notebooks/02-02-o3-normalize.py</a> for [O III]</li>
<li>They use the routine <code>pv_extract()</code> from the library</li>
</ul>
</div>
</div>
<div id="outline-container-orge8f77a3" class="outline-4">
<h4 id="orge8f77a3"><span class="section-number-4">2.3.3.</span> <span class="done DONE">DONE</span> TASK 02-03 Write out extracted PV spectra with celestial coordinates</h4>
<div class="outline-text-4" id="text-2-3-3">
<ul class="org-ul">
<li>This is done with the same notebooks as above</li>
<li>The files are in <a href="../data/pvextract/">../data/pvextract/</a></li>
<li>The have two different WCS systems
<ul class="org-ul">
<li>Default is just wavelength, offset</li>
<li><code>A</code> is a fancy one
<ul class="org-ul">
<li>with 3 WCS axes mapping on to 2 image axes</li>
<li>wavelength, RA, and Dec</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org85f846e" class="outline-3">
<h3 id="org85f846e"><span class="section-number-3">2.4.</span> <span class="done DONE">DONE</span> 03 Isovelocity images</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>This is done in 03-01-test-vmap
<ul class="org-ul">
<li>Notebook <a href="../notebooks/03-01-test-vmap.ipynb">../notebooks/03-01-test-vmap.ipynb</a></li>
<li>Pure python version: <a href="../notebooks/03-01-test-vmap.py">../notebooks/03-01-test-vmap.py</a></li>
</ul></li>
</ul>
</div>
</div>
