docs/pn-ou5-pipeline.org
** DONE 04 Combine axial slits and make some plots
CLOSED: [2022-04-19 Tue 22:05]
+ To improve the signal-to-noise, we can add together the slits that are not too far from the nebular axis
+ This is done in 04-01-coadd-slits
  + [[file:../notebooks/04-01-coadd-slits.ipynb]]
  + [[file:../notebooks/04-01-coadd-slits.py]]
+ The results are in [[file:../data/pv-common/]]
+ We also made some 1D spectra plots
** TODO Comparison of my slit positions with the paper
:LOGBOOK:
- State "TODO"       from              [2025-08-01 Fri 13:18] \\
  I am not sure that I believe all the slit positions that Tere has put in the paper
:END:
*** Table of spectra from 00-00-inspect-orig-files
- This is from the fits headers of all the files
- I am adding offset positions from 04-01-coadd-slits
**** Organized by date
| idx | File               |   DATE-OBS | FILTER   |          RA |          DEC | PA              | OFFSET | Tere |
|-----+--------------------+------------+----------+-------------+--------------+-----------------+--------+------|
|   1 | crN10036_bx        | 2017-08-29 | Ha 90A   |  21:15:04.3 |   43:46:40.0 | 8.63 , -351.37  |   2.32 | c    |
|   2 | crN10039_bx-oiii   | 2017-08-29 | OIII 60A |  21:15:02.8 |   43:46:48.0 | 8.63 , -351.37  |  2.324 | c    |
|   4 | crN10043_bx        | 2017-08-29 | Ha 90A   |  21:15:02.3 |   43:46:58.0 | 8.63 , -351.37  |   4.72 | b    |
|   5 | crN10045_bx-oiii   | 2017-08-29 | OIII 60A |  21:15:02.3 |    43:47:7.0 | 8.63 , -351.37  |   5.07 | b    |
|   8 | crN20004_bx        | 2017-08-30 | Ha 90A   |  21:15:03.8 |   43:45:27.0 | 360.00 , -0.00  |   4.53 | b    |
|   9 | crN20006_bx-oiii   | 2017-08-30 | OIII 60A |  21:15:03.9 |   43:45:26.0 | 360.00 , -0.00  |   4.53 | b    |
|  12 | crN20012_bx        | 2017-08-30 | Ha 90A   |  21:15:03.3 |   43:45:22.0 | 360.00 , -0.00  |  -0.38 | d    |
|  14 | crspm0021o_bx      | 2018-05-02 | Ha 90A   |  21:15:04.0 |    43:49:3.0 | 359.90 , -0.10  |   8.20 | a    |
|  15 | crspm0023o_bx-oiii | 2018-05-02 | OIII 60A |  21:15:05.1 |   43:48:57.0 | 359.90 , -0.10  |   8.81 | a    |
|  18 | crspm0048o_bx      | 2018-05-03 | Ha 90A   |  21:15:04.9 |   43:49:46.0 | 359.98 , -0.02  |   1.69 | c    |
|  19 | crspm0050o_bx      | 2018-05-03 | OIII 60A |  21:15:06.1 |   43:49:40.0 | 359.98 , -0.02  |   3.01 | c    |
|  22 | crspm0054o_bx      | 2018-05-03 | Ha 90A   |  21:15:07.6 |   43:49:29.0 | 359.98 , -0.02  |  -0.85 | d    |
|  23 | crspm0056o_bx      | 2018-05-03 | OIII 60A |  21:15:08.6 |   43:49:25.0 | 359.98 , -0.02  |  -0.19 | d    |
|  26 | crspm0105o_bx      | 2018-05-04 | Ha 90A   |  21:14:55.4 |   43:47:27.0 | 359.98 , -0.02  |  -3.24 | e    |
|  27 | crspm0107o_bx      | 2018-05-04 | OIII 60A |  21:14:56.6 |   43:47:22.0 | 359.98 , -0.02  |  -2.82 | e    |
|  30 | crspm0211o_b1t     | 2019-09-15 | Ha 90A   | 21:14:55.47 | +43:47:23.41 | 0.30 , -359.70  |  -0.38 | d    |
|  32 | crspm0215o_b1t     | 2019-09-15 | Ha 90A   | 21:14:55.00 | +43:47:34.36 | 0.30 , -359.70  |  -5.22 | f    |
|  34 | crspm0432o_b1t     | 2019-09-17 | Ha 90A   | 21:14:57.42 | +43:46:46.66 | 0.26 , -359.74  |   3.22 | b    |
|  36 | crspm0440o_b1t     | 2019-09-17 | Ha 90A   | 21:14:57.50 | +43:46:30.76 | 84.35 , -275.65 |  0.317 | g    |
|  38 | crspm0601o_b1t     | 2019-09-18 | Ha 90A   | 21:15:03.60 | +43:46:43.22 | 0.26 , -359.74  |  -6.29 | f    |
|     |                    |            |          |             |              |                 |        |      |
