docs/pn-ou5-pipeline.html
<div id="outline-container-orgea97317" class="outline-3">
<h3 id="orgea97317"><span class="section-number-3">2.5.</span> <span class="done DONE">DONE</span> 04 Combine axial slits and make some plots</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li>To improve the signal-to-noise, we can add together the slits that are not too far from the nebular axis</li>
<li>This is done in 04-01-coadd-slits
<ul class="org-ul">
<li><a href="../notebooks/04-01-coadd-slits.ipynb">../notebooks/04-01-coadd-slits.ipynb</a></li>
<li><a href="../notebooks/04-01-coadd-slits.py">../notebooks/04-01-coadd-slits.py</a></li>
</ul></li>
<li>The results are in <a href="../data/pv-common/">../data/pv-common/</a></li>
<li>We also made some 1D spectra plots</li>
</ul>
</div>
</div>
<div id="outline-container-org8d405ad" class="outline-3">
<h3 id="org8d405ad"><span class="section-number-3">2.6.</span> <span class="todo TODO">TODO</span> Comparison of my slit positions with the paper</h3>
<div class="outline-text-3" id="text-2-6">
</div>
<div id="outline-container-orgda07da0" class="outline-4">
<h4 id="orgda07da0"><span class="section-number-4">2.6.1.</span> Table of spectra from 00-00-inspect-orig-files</h4>
<div class="outline-text-4" id="text-2-6-1">
<ul class="org-ul">
<li>This is from the fits headers of all the files</li>
<li>I am adding offset positions from 04-01-coadd-slits</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="orgfebcfea"></a>Organized by date<br />
<div class="outline-text-5" id="text-2-6-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">idx</th>
<th scope="col" class="org-left">File</th>
<th scope="col" class="org-right">DATE-OBS</th>
<th scope="col" class="org-left">FILTER</th>
<th scope="col" class="org-right">RA</th>
<th scope="col" class="org-right">DEC</th>
<th scope="col" class="org-left">PA</th>
<th scope="col" class="org-right">OFFSET</th>
<th scope="col" class="org-left">Tere</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">crN10036_bx</td>
<td class="org-right">2017-08-29</td>
<td class="org-left">Ha 90A</td>
<td class="org-right">21:15:04.3</td>
<td class="org-right">43:46:40.0</td>
<td class="org-left">8.63 , -351.37</td>
<td class="org-right">2.32</td>
<td class="org-left">c</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">crN10039_bx-oiii</td>
<td class="org-right">2017-08-29</td>
<td class="org-left">OIII 60A</td>
<td class="org-right">21:15:02.8</td>
<td class="org-right">43:46:48.0</td>
<td class="org-left">8.63 , -351.37</td>
<td class="org-right">2.324</td>
<td class="org-left">c</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">crN10043_bx</td>
<td class="org-right">2017-08-29</td>
<td class="org-left">Ha 90A</td>
<td class="org-right">21:15:02.3</td>
<td class="org-right">43:46:58.0</td>
<td class="org-left">8.63 , -351.37</td>
<td class="org-right">4.72</td>
<td class="org-left">b</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">crN10045_bx-oiii</td>
<td class="org-right">2017-08-29</td>
<td class="org-left">OIII 60A</td>
<td class="org-right">21:15:02.3</td>
<td class="org-right">43:47:7.0</td>
<td class="org-left">8.63 , -351.37</td>
<td class="org-right">5.07</td>
<td class="org-left">b</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-left">crN20004_bx</td>
<td class="org-right">2017-08-30</td>
<td class="org-left">Ha 90A</td>
<td class="org-right">21:15:03.8</td>
<td class="org-right">43:45:27.0</td>
<td class="org-left">360.00 , -0.00</td>
<td class="org-right">4.53</td>
<td class="org-left">b</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-left">crN20006_bx-oiii</td>
<td class="org-right">2017-08-30</td>
<td class="org-left">OIII 60A</td>
<td class="org-right">21:15:03.9</td>
<td class="org-right">43:45:26.0</td>
<td class="org-left">360.00 , -0.00</td>
<td class="org-right">4.53</td>
<td class="org-left">b</td>
</tr>

<tr>
<td class="org-right">12</td>
<td class="org-left">crN20012_bx</td>
<td class="org-right">2017-08-30</td>
<td class="org-left">Ha 90A</td>
<td class="org-right">21:15:03.3</td>
<td class="org-right">43:45:22.0</td>
<td class="org-left">360.00 , -0.00</td>
<td class="org-right">-0.38</td>
<td class="org-left">d</td>
</tr>

<tr>
<td class="org-right">14</td>
<td class="org-left">crspm0021o_bx</td>
<td class="org-right">2018-05-02</td>
<td class="org-left">Ha 90A</td>
<td class="org-right">21:15:04.0</td>
<td class="org-right">43:49:3.0</td>
<td class="org-left">359.90 , -0.10</td>
<td class="org-right">8.20</td>
<td class="org-left">a</td>
</tr>

<tr>
<td class="org-right">15</td>
<td class="org-left">crspm0023o_bx-oiii</td>
<td class="org-right">2018-05-02</td>
<td class="org-left">OIII 60A</td>
<td class="org-right">21:15:05.1</td>
<td class="org-right">43:48:57.0</td>
<td class="org-left">359.90 , -0.10</td>
<td class="org-right">8.81</td>
<td class="org-left">a</td>
</tr>

<tr>
<td class="org-right">18</td>
<td class="org-left">crspm0048o_bx</td>
<td class="org-right">2018-05-03</td>
<td class="org-left">Ha 90A</td>
<td class="org-right">21:15:04.9</td>
<td class="org-right">43:49:46.0</td>
<td class="org-left">359.98 , -0.02</td>
<td class="org-right">1.69</td>
<td class="org-left">c</td>
</tr>

<tr>
<td class="org-right">19</td>
<td class="org-left">crspm0050o_bx</td>
<td class="org-right">2018-05-03</td>
<td class="org-left">OIII 60A</td>
<td class="org-right">21:15:06.1</td>
<td class="org-right">43:49:40.0</td>
<td class="org-left">359.98 , -0.02</td>
<td class="org-right">3.01</td>
<td class="org-left">c</td>
</tr>

<tr>
<td class="org-right">22</td>
<td class="org-left">crspm0054o_bx</td>
<td class="org-right">2018-05-03</td>
<td class="org-left">Ha 90A</td>
<td class="org-right">21:15:07.6</td>
<td class="org-right">43:49:29.0</td>
<td class="org-left">359.98 , -0.02</td>
<td class="org-right">-0.85</td>
<td class="org-left">d</td>
</tr>

<tr>
<td class="org-right">23</td>
<td class="org-left">crspm0056o_bx</td>
<td class="org-right">2018-05-03</td>
<td class="org-left">OIII 60A</td>
<td class="org-right">21:15:08.6</td>
<td class="org-right">43:49:25.0</td>
<td class="org-left">359.98 , -0.02</td>
<td class="org-right">-0.19</td>
<td class="org-left">d</td>
</tr>

<tr>
<td class="org-right">26</td>
<td class="org-left">crspm0105o_bx</td>
<td class="org-right">2018-05-04</td>
<td class="org-left">Ha 90A</td>
<td class="org-right">21:14:55.4</td>
<td class="org-right">43:47:27.0</td>
<td class="org-left">359.98 , -0.02</td>
<td class="org-right">-3.24</td>
<td class="org-left">e</td>
</tr>

<tr>
<td class="org-right">27</td>
<td class="org-left">crspm0107o_bx</td>
<td class="org-right">2018-05-04</td>
<td class="org-left">OIII 60A</td>
<td class="org-right">21:14:56.6</td>
<td class="org-right">43:47:22.0</td>
<td class="org-left">359.98 , -0.02</td>
<td class="org-right">-2.82</td>
<td class="org-left">e</td>
</tr>

<tr>
<td class="org-right">30</td>
<td class="org-left">crspm0211o_b1t</td>
<td class="org-right">2019-09-15</td>
<td class="org-left">Ha 90A</td>
<td class="org-right">21:14:55.47</td>
<td class="org-right">+43:47:23.41</td>
<td class="org-left">0.30 , -359.70</td>
<td class="org-right">-0.38</td>
<td class="org-left">d</td>
</tr>

<tr>
<td class="org-right">32</td>
<td class="org-left">crspm0215o_b1t</td>
<td class="org-right">2019-09-15</td>
<td class="org-left">Ha 90A</td>
<td class="org-right">21:14:55.00</td>
<td class="org-right">+43:47:34.36</td>
<td class="org-left">0.30 , -359.70</td>
<td class="org-right">-5.22</td>
<td class="org-left">f</td>
</tr>

<tr>
<td class="org-right">34</td>
<td class="org-left">crspm0432o_b1t</td>
<td class="org-right">2019-09-17</td>
<td class="org-left">Ha 90A</td>
<td class="org-right">21:14:57.42</td>
<td class="org-right">+43:46:46.66</td>
<td class="org-left">0.26 , -359.74</td>
<td class="org-right">3.22</td>
<td class="org-left">b</td>
</tr>

<tr>
<td class="org-right">36</td>
<td class="org-left">crspm0440o_b1t</td>
<td class="org-right">2019-09-17</td>
<td class="org-left">Ha 90A</td>
<td class="org-right">21:14:57.50</td>
<td class="org-right">+43:46:30.76</td>
<td class="org-left">84.35 , -275.65</td>
<td class="org-right">0.317</td>
<td class="org-left">g</td>
</tr>

<tr>
<td class="org-right">38</td>
<td class="org-left">crspm0601o_b1t</td>
<td class="org-right">2019-09-18</td>
<td class="org-left">Ha 90A</td>
<td class="org-right">21:15:03.60</td>
<td class="org-right">+43:46:43.22</td>
<td class="org-left">0.26 , -359.74</td>
<td class="org-right">-6.29</td>
<td class="org-left">f</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</li>
