docs/pn-ou5-pipeline.html
<li><a id="org28ca4a3"></a>Organized by position, slit width, line<br />
<div class="outline-text-5" id="text-2-6-1-2">
<p>
Vertical Ha 150
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">idx</th>
<th scope="col" class="org-left">File</th>
<th scope="col" class="org-right">DATE-OBS</th>
<th scope="col" class="org-left">FILTER</th>
<th scope="col" class="org-right">RA</th>
<th scope="col" class="org-right">DEC</th>
<th scope="col" class="org-left">PA</th>
<th scope="col" class="org-right">OFFSET</th>
<th scope="col" class="org-left">Tere</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">14</td>
<td class="org-left">crspm0021o_bx</td>
<td class="org-right">2018-05-02</td>
<td class="org-left">Ha 90A</td>
<td class="org-right">21:15:04.0</td>
<td class="org-right">43:49:3.0</td>
<td class="org-left">359.90 , -0.10</td>
<td class="org-right">8.20</td>
<td class="org-left">a</td>
</tr>

<tr>
<td class="org-right">34</td>
<td class="org-left">crspm0432o_b1t</td>
<td class="org-right">2019-09-17</td>
<td class="org-left">Ha 90A</td>
<td class="org-right">21:14:57.42</td>
<td class="org-right">+43:46:46.66</td>
<td class="org-left">0.26 , -359.74</td>
<td class="org-right">3.22</td>
<td class="org-left">b</td>
</tr>

<tr>
<td class="org-right">18</td>
<td class="org-left">crspm0048o_bx</td>
<td class="org-right">2018-05-03</td>
<td class="org-left">Ha 90A</td>
<td class="org-right">21:15:04.9</td>
<td class="org-right">43:49:46.0</td>
<td class="org-left">359.98 , -0.02</td>
<td class="org-right">1.69</td>
<td class="org-left">c</td>
</tr>

<tr>
<td class="org-right">30</td>
<td class="org-left">crspm0211o_b1t</td>
<td class="org-right">2019-09-15</td>
<td class="org-left">Ha 90A</td>
<td class="org-right">21:14:55.47</td>
<td class="org-right">+43:47:23.41</td>
<td class="org-left">0.30 , -359.70</td>
<td class="org-right">-0.38</td>
<td class="org-left">d</td>
</tr>

<tr>
<td class="org-right">22</td>
<td class="org-left">crspm0054o_bx</td>
<td class="org-right">2018-05-03</td>
<td class="org-left">Ha 90A</td>
<td class="org-right">21:15:07.6</td>
<td class="org-right">43:49:29.0</td>
<td class="org-left">359.98 , -0.02</td>
<td class="org-right">-0.85</td>
<td class="org-left">d</td>
</tr>

<tr>
<td class="org-right">26</td>
<td class="org-left">crspm0105o_bx</td>
<td class="org-right">2018-05-04</td>
<td class="org-left">Ha 90A</td>
<td class="org-right">21:14:55.4</td>
<td class="org-right">43:47:27.0</td>
<td class="org-left">359.98 , -0.02</td>
<td class="org-right">-3.24</td>
<td class="org-left">e</td>
</tr>

<tr>
<td class="org-right">32</td>
<td class="org-left">crspm0215o_b1t</td>
<td class="org-right">2019-09-15</td>
<td class="org-left">Ha 90A</td>
<td class="org-right">21:14:55.00</td>
<td class="org-right">+43:47:34.36</td>
<td class="org-left">0.30 , -359.70</td>
<td class="org-right">-5.22</td>
<td class="org-left">f</td>
</tr>

<tr>
<td class="org-right">38</td>
<td class="org-left">crspm0601o_b1t</td>
<td class="org-right">2019-09-18</td>
<td class="org-left">Ha 90A</td>
<td class="org-right">21:15:03.60</td>
<td class="org-right">+43:46:43.22</td>
<td class="org-left">0.26 , -359.74</td>
<td class="org-right">-6.29</td>
<td class="org-left">f</td>
</tr>
</tbody>
</table>

<p>
Vertical Ha 70
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">idx</th>
<th scope="col" class="org-left">File</th>
<th scope="col" class="org-right">DATE-OBS</th>
<th scope="col" class="org-left">FILTER</th>
<th scope="col" class="org-right">RA</th>
<th scope="col" class="org-right">DEC</th>
<th scope="col" class="org-left">PA</th>
<th scope="col" class="org-right">OFFSET</th>
<th scope="col" class="org-left">Tere</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">4</td>
<td class="org-left">crN10043_bx</td>
<td class="org-right">2017-08-29</td>
<td class="org-left">Ha 90A</td>
<td class="org-right">21:15:02.3</td>
<td class="org-right">43:46:58.0</td>
<td class="org-left">8.63 , -351.37</td>
<td class="org-right">4.72</td>
<td class="org-left">b</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-left">crN20004_bx</td>
<td class="org-right">2017-08-30</td>
<td class="org-left">Ha 90A</td>
<td class="org-right">21:15:03.8</td>
<td class="org-right">43:45:27.0</td>
<td class="org-left">360.00 , -0.00</td>
<td class="org-right">4.53</td>
<td class="org-left">b</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">crN10036_bx</td>
<td class="org-right">2017-08-29</td>
<td class="org-left">Ha 90A</td>
<td class="org-right">21:15:04.3</td>
<td class="org-right">43:46:40.0</td>
<td class="org-left">8.63 , -351.37</td>
<td class="org-right">2.32</td>
<td class="org-left">c</td>
</tr>

<tr>
<td class="org-right">12</td>
<td class="org-left">crN20012_bx</td>
<td class="org-right">2017-08-30</td>
<td class="org-left">Ha 90A</td>
<td class="org-right">21:15:03.3</td>
<td class="org-right">43:45:22.0</td>
<td class="org-left">360.00 , -0.00</td>
<td class="org-right">-0.38</td>
<td class="org-left">d</td>
</tr>
</tbody>
</table>


<p>
Vertical [O III] 150
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">idx</th>
<th scope="col" class="org-left">File</th>
<th scope="col" class="org-right">DATE-OBS</th>
<th scope="col" class="org-left">FILTER</th>
<th scope="col" class="org-right">RA</th>
<th scope="col" class="org-right">DEC</th>
<th scope="col" class="org-left">PA</th>
<th scope="col" class="org-right">OFFSET</th>
<th scope="col" class="org-left">Tere</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">15</td>
<td class="org-left">crspm0023o_bx-oiii</td>
<td class="org-right">2018-05-02</td>
<td class="org-left">OIII 60A</td>
<td class="org-right">21:15:05.1</td>
<td class="org-right">43:48:57.0</td>
<td class="org-left">359.90 , -0.10</td>
<td class="org-right">8.81</td>
<td class="org-left">a</td>
</tr>

<tr>
<td class="org-right">19</td>
<td class="org-left">crspm0050o_bx</td>
<td class="org-right">2018-05-03</td>
<td class="org-left">OIII 60A</td>
<td class="org-right">21:15:06.1</td>
<td class="org-right">43:49:40.0</td>
<td class="org-left">359.98 , -0.02</td>
<td class="org-right">3.01</td>
<td class="org-left">c</td>
</tr>

<tr>
<td class="org-right">23</td>
<td class="org-left">crspm0056o_bx</td>
<td class="org-right">2018-05-03</td>
<td class="org-left">OIII 60A</td>
<td class="org-right">21:15:08.6</td>
<td class="org-right">43:49:25.0</td>
<td class="org-left">359.98 , -0.02</td>
<td class="org-right">-0.19</td>
<td class="org-left">d</td>
</tr>

<tr>
<td class="org-right">27</td>
<td class="org-left">crspm0107o_bx</td>
<td class="org-right">2018-05-04</td>
<td class="org-left">OIII 60A</td>
<td class="org-right">21:14:56.6</td>
<td class="org-right">43:47:22.0</td>
<td class="org-left">359.98 , -0.02</td>
<td class="org-right">-2.82</td>
<td class="org-left">e</td>
</tr>
</tbody>
</table>

<p>
Vertical [O III] 70
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">idx</th>
<th scope="col" class="org-left">File</th>
<th scope="col" class="org-right">DATE-OBS</th>
<th scope="col" class="org-left">FILTER</th>
<th scope="col" class="org-right">RA</th>
<th scope="col" class="org-right">DEC</th>
<th scope="col" class="org-left">PA</th>
<th scope="col" class="org-right">OFFSET</th>
<th scope="col" class="org-left">Tere</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">5</td>
<td class="org-left">crN10045_bx-oiii</td>
<td class="org-right">2017-08-29</td>
<td class="org-left">OIII 60A</td>
<td class="org-right">21:15:02.3</td>
<td class="org-right">43:47:7.0</td>
<td class="org-left">8.63 , -351.37</td>
<td class="org-right">5.07</td>
<td class="org-left">b</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-left">crN20006_bx-oiii</td>
<td class="org-right">2017-08-30</td>
<td class="org-left">OIII 60A</td>
<td class="org-right">21:15:03.9</td>
<td class="org-right">43:45:26.0</td>
<td class="org-left">360.00 , -0.00</td>
<td class="org-right">4.53</td>
<td class="org-left">b</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">crN10039_bx-oiii</td>
<td class="org-right">2017-08-29</td>
<td class="org-left">OIII 60A</td>
<td class="org-right">21:15:02.8</td>
<td class="org-right">43:46:48.0</td>
<td class="org-left">8.63 , -351.37</td>
<td class="org-right">2.324</td>
<td class="org-left">c</td>
</tr>
</tbody>
</table>


<p>
Horizontal
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">idx</th>
<th scope="col" class="org-left">File</th>
<th scope="col" class="org-right">DATE-OBS</th>
<th scope="col" class="org-left">FILTER</th>
<th scope="col" class="org-right">RA</th>
<th scope="col" class="org-right">DEC</th>
<th scope="col" class="org-left">PA</th>
<th scope="col" class="org-right">OFFSET</th>
<th scope="col" class="org-left">Tere</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">36</td>
<td class="org-left">crspm0440o_b1t</td>
<td class="org-right">2019-09-17</td>
<td class="org-left">Ha 90A</td>
<td class="org-right">21:14:57.50</td>
<td class="org-right">+43:46:30.76</td>
<td class="org-left">84.35 , -275.65</td>
<td class="org-right">0.317</td>
<td class="org-left">g</td>
</tr>
</tbody>
</table>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org3cd2fe2" class="outline-2">
<h2 id="org3cd2fe2"><span class="section-number-2">3.</span> Initial messages from Teresa</h2>
<div class="outline-text-2" id="text-3">
</div>
